# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightGroup..::..Name Property
LightGroup Class See Also
---
The name of the LightGroup
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string Name { get; set; }
```

Visual Basic
---
```text
Public Property Name As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: name cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". -or- When setting this property: The name is not valid because it is not unique within this LightGroupManager |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace